---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeTable.GetBasicIEnumerator
source: html/3ce14b4a-0907-1787-2390-2ef11e8df2cc.htm
---
# Autodesk.Revit.DB.ExportLinetypeTable.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.